public class Majeed.Layout.ListBox : Gtk.ListBox {



    construct {
        set_activate_on_single_click(true);
        var label = new Gtk.Label("أحكام القرآن، ج ٣، ابن العربي، ص ١ هو الذي يسيركم في البر والبحر حتى إذا كنتم في الفلك وجرين بهم بريح طيبة وفرحوا بها جاءتها ريح عاصف وجاءهم الموج من كل مكان وظنوا أنهم أحيط بهم دعوا الله مخلصين له الدين لئن أنجيتنا من هذه لنكونن من الشاكرين
                                  ------------------------------
                                  ");
        add(label);


    }
}
